---
kind: property
id: P:Autodesk.Revit.DB.Profile.Curves
source: html/a5ccc7dc-b52f-a0d7-ba07-7d4a59a0d527.htm
---
# Autodesk.Revit.DB.Profile.Curves Property

Retrieve the curves that make up the boundary of the profile.

## Syntax (C#)
```csharp
public CurveArray Curves { get; }
```